{"title":"Project-Summary","date":"2019-10-23T03:53:28.000Z","link":"2019/10/23/Project-Summary","updated":"2019-10-23T03:59:27.741Z","content":"<h3 id=\"What-is-my-project\">What is my project?<a href=\"2019/10/23/Project-Summary#What-is-my-project\"></a></h3><p>With the rapid progress of TV series and film industries, I noticed that there were increasing number of directors trying to find prevalent novels and adapt them into series or films in order to increase box office, because they considered that literal value and reader basis have already existed for a novel, which guarantees a certain number of audience who are willing to watch the products without ensuring the quality, thereby eliminating risks of losing investment. I advanced this topic in order to explore whether this factor actually played a vital role in the film factory in reality.</p>\n<h3 id=\"What-are-my-research-target-and-research-method\">What are my research target and research method?<a href=\"2019/10/23/Project-Summary#What-are-my-research-target-and-research-method\"></a></h3><p>I was determined to explore this phenomenon in China and the United States, which are two main film sources in China. Douban, a common online platform of discussions about movies and books, was my main data source, and basic information of the films such as country, release year, type, whether adapted from books, and Douban rating were utilized as variables by me. Maoyan website was also used to collect the box offices. I chose 232 movies in total and popular types in each country as my data set as the following table.<br>Number of films are equally distributed in each film type. R language was used for grabbing data online into an excel table with external help, and Stata was used to process and display the result.</p>\n<div class=\"article-bounded\"><div class=\"article-table\"><table>\n<thead>\n<tr>\n<th>China:122</th>\n<th>The United States:110</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Romantic</td>\n<td>Romantic</td>\n</tr>\n<tr>\n<td>Comedy</td>\n<td>Fiction</td>\n</tr>\n<tr>\n<td>Historical</td>\n<td>Animated</td>\n</tr>\n</tbody></table></div></div>\n<p>When comparing ratings of same films on Maoyan and Douban, I found that the average ratings of films are higher on Maoyan, including some films that are widely considered as colorless, so I asked and searched whether this gap would happen. Later, I recognized that Maoyan is a platform to buy film tickets and Douban is a platform only for evaluation. On the Maoyan website, there are audience from different age groups, and a considerable part of them will rate the film by evaluating whether the film or service worth the ticket price, but on the Douban website, most users rate the film from its production: special effect, performers’ expression, the plots etc. Therefore, I selected Douban rating as my variable, for it put emphasis on films’ quality.</p>\n<h3 id=\"What-was-the-biggest-challenge-that-I-encountered-How-did-I-overcome-it\">What was the biggest challenge that I encountered? How did I overcome it?<a href=\"2019/10/23/Project-Summary#What-was-the-biggest-challenge-that-I-encountered-How-did-I-overcome-it\"></a></h3><p>Two main tools, R language for scraping data and Stata for analysis, both were totally new to me. I had only learnt a few basic expressions in R; however, I needed to understand sophisticated codes to grab data from websites to my database. Similarly, I had never used the software Stata before this program, and I had to search and input codes to implement various functions that I needed.</p>\n<h3 id=\"What-was-the-most-interesting-part-of-my-project\">What was the most interesting part of my project?<a href=\"2019/10/23/Project-Summary#What-was-the-most-interesting-part-of-my-project\"></a></h3><p>I think it must be the time to view my results, testing whether movies adapted from films were actually more popular in the market. It is when getting out of assumptions to the real-life situation.</p>\n<h3 id=\"What-are-my-research-result-s-and-conclusion-s\">What are my research result(s) and conclusion(s)?<a href=\"2019/10/23/Project-Summary#What-are-my-research-result-s-and-conclusion-s\"></a></h3><p>Actually, films adapted from novels did not play a successful role in the industry. The original films are still attractive if the quality is guaranteed.</p>\n<h3 id=\"What-have-I-learned-in-this-project-Anything-more-I-want-to-add\">What have I learned in this project? Anything more I want to add?<a href=\"2019/10/23/Project-Summary#What-have-I-learned-in-this-project-Anything-more-I-want-to-add\"></a></h3><p>I have learnt R language, Stata, and action of turning statistics to conclusions to verify hypothesis. There are still limitations in my project for I only grabbed data from over 200 films, which could be a small part in the film industry. I am looking forward to continuing this project after my application.</p>\n","prev":{"title":"About-Me","link":"2019/10/23/About-Me"},"plink":"http://yoursite.com/2019/10/23/Project-Summary/"}